Autodesk.Revit.DB.LinkLoadResultType
Enum listing the possible results after loading a linked model.
Remarks:
For all values except LinkLoadResultType.LinkLoaded, the linked model
is not loaded and no new link is created (if Revit was trying to create a link).
Since:
2013
Since:
2013

Autodesk.Revit.DB.LinkLoadResultType.UsedExisting
Revit already has a link with the input location, so the same link is been reused.

Autodesk.Revit.DB.LinkLoadResultType.CouldNotChangeViewReference
The link previously had an invalid view reference and either
no new view was provided or the input view was not usable
for linking CAD files.

Autodesk.Revit.DB.LinkLoadResultType.LinkExists
Revit already has a link with the input location, so no new link
can be created.

Autodesk.Revit.DB.LinkLoadResultType.ExternalServerMissing
The external add-in required to load this link model could not be found.

Autodesk.Revit.DB.LinkLoadResultType.LinkMayBeUpgraded
Point cloud link loaded correctly but is obsolete and may be upgraded.

Autodesk.Revit.DB.LinkLoadResultType.LinkNotLoadedOtherError
An unknown error occurred.

Autodesk.Revit.DB.LinkLoadResultType.SameCentralModelAsHost
Either the linked model and its host document are both locals of the same
central model, or one is a local and the other is its central.

Autodesk.Revit.DB.LinkLoadResultType.SameModelAsHost
The linked model has the same path as the currently active document.

Autodesk.Revit.DB.LinkLoadResultType.LinkOpenAsHost
The linked model is already opened directly in Revit.

Autodesk.Revit.DB.LinkLoadResultType.LinkNotOpenable
An error occurred trying to read the linked model. It could happen if
a wrong link type is trying to be loaded.

Autodesk.Revit.DB.LinkLoadResultType.LinkNotFound
The linked model could not be found.

Autodesk.Revit.DB.LinkLoadResultType.LinkLoaded
The linked model loaded correctly.

Autodesk.Revit.DB.LinkLoadResultType.Uninitialized
Revit has not tried to load the link, possibly because it is a nested
link and its parent failed to load.